# =========================================================================
# 1. Напишите программу, которая принимает на вход цифру,
# обозначающую день недели, и проверяет, является ли этот день выходным.
# *Пример:*
# - 6 -> да
# - 7 -> да
# - 1 -> нет
# ========================================================================

print("Задача 1:")
day = 0
while day < 1 or day > 7:
    day = int(input("введите число, обозначающее день недели(1-7): "))
    if day < 1 or day > 7:
        print("Неверные данные, повторите ввод")
else:
    if day < 6:
        print("Рабочий день")
    else:
        print("Выходной")

# ========================================================================
# 2. Напишите программу для. проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
# =======================================================================

print("Задача 2:")
count = 0
for x in range(2):
    for y in range(2):
        for z in range(2):
            if not (x or y or z) == (not x and not y and not z):
                count += 1
print("Количество истинных вычислений: ", count)
if count == 2 ** 3:
    print("Утверждение истинно!")
else:
    print("Утверждение ложно!")

# =========================================================================
# 3. Напишите программу, которая принимает на вход координаты точки (X и Y),
#    причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой
#    находится эта точка (или на какой оси она находится).
#  *Пример:*
#   - x=34; y=-30 -> 4
#   - x=2; y=4-> 1
#   - x=-34; y=-30 -> 3
# =====================================================================
print("Задача 3:")
coord_x = int(input("введите координату X для точки: "))
coord_y = int(input("введите координату Y для точки: "))
if coord_x == 0 or coord_y == 0:
    print("задайте координаты отличные от нуля!")
else:
    if coord_x > 0 and coord_y > 0:
        print("1")
    elif coord_x < 0 and coord_y > 0:
        print("2")
    elif coord_x < 0 and coord_y < 0:
        print("3")
    elif coord_x > 0 and coord_y < 0:
        print("4")

# =======================================================================
# 4. Напишите программу, которая по заданному номеру четверти, показывает
#    диапазон возможных координат точек в этой четверти (x и y).
#   *Пример:*
#   in 1 out x>0, y>0;
#   in 3 out x<0,y<0;
#
# =======================================================================

print("Задача 4:")
num = int(input("Задайте номер четверти(1-4) для плоскости координат: "))
if num < 1 or num > 4:
    print("Номер четверти 1 до 4 !")
else:
    if num == 1:
        print("x>0, y>0")
    elif num == 2:
        print("x<0, y>0")
    elif num == 3:
        print("x<0, y<0")
    elif num == 4:
        print("x>0,y<0")

# =======================================================================
# 5. Напишите программу, которая принимает на вход координаты двух точек
#   и находит расстояние между ними в 2D пространстве.
#   https://ru.onlinemschool.com/math/library/analytic_geometry/point_point_length/
#   in
#   - 3
#   - 6
#   - 2
#   - 1
#   out
#   5.099
# =======================================================================

print("Задача 5:")
coord_x_a = int(input("Введите координату Х точки A: "))
coord_y_a = int(input("Введите координату Y точки A: "))
coord_x_b = int(input("Введите координату Х точки B: "))
coord_y_b = int(input("Введите координату Y точки B: "))
ab = ((coord_x_b - coord_x_a) ** 2 + (coord_y_b - coord_y_a) ** 2) ** 0.5
print("Расстояние между точками А и В в 2D пространстве: ", f"{ab:.3f}")
