# ===================================================================================
# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь,
#       ключи — первые буквы имён, значения — списки, содержащие имена,
#       начинающиеся с соответствующей буквы.
# in >> "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out >> {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}
# -----------------------------------------------------------------------------------

def create_dictionary(ls: list):
    dictionary = {}
    ls = sorted(ls)
    for i in ls:
        ch = i[0]
        if ch not in dictionary:
            dictionary[ch] = [i]
        else:
            dictionary[ch].append(i)
    return dictionary


iput_list = ["Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"]
print(f"Формируем словарь из строки {iput_list}")
print(create_dictionary(iput_list))
