# ============================================================
# 3. Задайте два числа. Напишите программу, которая найдёт
#    НОК (наименьшее общее кратное) этих двух чисел.
#
#  in >> 17     in >> 14        in >> 0
#     >> 11        >> 18           >> 0
# out >> 187    out >> 126      out >> 0
# ------------------------------------------------------------

from math import gcd


def nok(first, second):
    return (first * second) // gcd(first, second)


print("Введите два числа: ")
a = int(input("a = "))
b = int(input("b = "))

print(nok(a, b))
