# =====================================================================
# 1. Напишите программу, которая принимает на вход вещественное число
#    и показывает сумму его цифр.
# in -> out
# - 6782 -> 23
# - 0.67 -> 13
# - 198.45 -> 27
# =======================================================================
import random

print("Эадача 1:")
f_num = float(input("Введите вещественное число: ").replace(",", ".").replace("-", ""))
e = -1
stat_con = 1
while stat_con:
    e += 1
    a = f_num * 10 ** e
    stat_con = int(a) - a
num = int(a)
print("целое=", num)
summa = 0
while num:
    summa += num % 10
    num //= 10
print("Сумма цифр числа=", summa)

# =======================================================================
# 2. Напишите программу, которая принимает на вход число N и выдает набор
#    произведений чисел от 1 до N.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]
# =======================================================================

print("Эадача 2:")
num = int(input("Введите целое число: ").replace("-", "").replace(",", ".").split(".")[0])
resultat = []
num_out = 1
num += 1
for i in range(1, num):
    num_out *= i
    resultat.append(num_out)
print(resultat)

# =======================================================================
# 3. Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и
#    выведите на экран их сумму.
#    Для n = 6: [2, 2, 2, 2, 2, 3] -> 13
# =======================================================================

print("Эадача 3:")
num = int(input("Введите целое число: ").replace("-", "").replace(",", ".").split(".")[0])
resultat = []
summa = 0
num += 1
for i in range(1, num):
    num_out = round((1 + 1 / i) ** i)
    resultat.append(num_out)
    summa += num_out
print("Список чисел = ", resultat)
print("Сумма чисел в списке = ", summa)

# =======================================================================
# 4.* Напишите программу, которая принимает на вход 2 числа. Задайте список
#    из N элементов, заполненных числами из промежутка [-N, N].
#    Найдите произведение элементов на указанных позициях(не индексах).
# Position one: 1
# Position two: 3
# Number of elements: 5
# -> [-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5]
# -> 15
# =======================================================================

print("Эадача 4:")
num_1 = int(input("Введите позицию 1го числа: ").replace("-", "").replace(",", ".").split(".")[0])
num_2 = int(input("Введите позицию 2го числа: ").replace("-", "").replace(",", ".").split(".")[0])
count_elem = int(input("Введите количество элементов: ").replace("-", "").replace(",", ".").split(".")[0])
resultat = list(range(-count_elem, count_elem + 1))
print("Список элементов = ", resultat)
mult = resultat[num_1 - 1] * resultat[num_2 - 1]
print("Произведение элементов в выбранных позициях = ", mult)

# =======================================================================
# 5. ** Реализуйте алгоритм перемешивания списка. Без функции shuffle
#     из модуля random.
# 10
# -> [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# -> [0, 7, 6, 3, 4, 2, 9, 5, 1, 8]
# =======================================================================

print("Эадача 5:")
num = int(input("Введите количество элементов: ").replace("-", "").replace(",", ".").split(".")[0])
spisok = list(range(num))
print(spisok)
for i in spisok:
    pos = random.randint(0, i + 1)
    spisok[i], spisok[pos] = spisok[pos], spisok[i]
print(spisok)
